[
  {
    "heading": "31 March 2023",
    "whatsNew": [
      "Shared emails: we added shared mailboxes to the email address lookup. This means you can notify a whole team of an allocation.",
      "Cases allocated in the last 30 days: we introduced a new tab to the Unallocated cases screen, where you can see a list of the cases you’ve allocated through the service in the last 30 days.",
      "Updated risk content: we added ‘at a glance’ risk information to the Summary screen. The person on probation’s full details are still found on the Risk screen."
    ],
    "technicalFixes": [
      "We fixed an issue where the allocation demand was not updated when a case was being transferred to a different team."
    ]
  },
  {
    "heading": "17 February 2023",
    "whatsNew": [
      "Email autocomplete: we added email autocomplete functionality when sending allocation instructions, so you don't have to enter email addresses manually.",
      "Viewing allocation demand: we introduced a new process for surfacing allocation demand, that allows you to see unallocated cases in any team within a probation delivery unit (PDU).",
      "Start page: we added a Start page to the service, which explains the team selection and allocation demand processes to new users. This will only be seen once, when you first sign in.",
      "Allocating to multiple teams: we updated the Allocate to a probation practitioner screen, giving SPOs that allocate to multiple teams the option to view staff in a single list, or in their separate teams.",
      "Service name: we formalised the name for the service - ‘Allocate a Person on Probation’ - which was previously known as ‘Allocations’.",
      "Accessibility: we updated the Choose a practitioner table so the link to the practitioner’s Workload information is the practitioner’s name (rather than ‘View’). This is best practice for accessibility."
    ],
    "technicalFixes": [
      "We fixed an issue where users were unable to allocate a case if Javascript was turned off.",
      "We amended the process behind displaying the Allocation complete screen to reduce ‘page not found’ errors when users refresh the page.",
      "We fixed an issue where adding another email address on the Allocation instructions screen was moving the focus to the top of the page. The focus is now anchored to the email input box."
    ]
  }
]
