[
  {
    "heading": "27 February 2025",
    "whatsNew": [
      "Inclusion of Limited Access Offender (LAO) cases: Some LAO cases can now be allocated. These will be shown with a ‘Restricted access’ badge beneath the person on probation’s name.",
      "Change to unallocated cases screen: We now show allocations made by all SPOs in the selected team over the last 30 days. Previously only allocations made by the selected SPO would be shown.",
      "Improvements to the Documents screen: Accessing the allocation notes section on the Documents screen can involve a considerable amount of scrolling when a large number of documents are shown. We’ve added a ‘Skip to allocation notes’ button to enable users to navigate quickly to their allocation notes on this screen.",
      "Global address list (GAL) update: On the Review your allocation notes screen we’ve restricted the ‘Add another recipient’ field to accept only justice.gov.uk emails within the GAL. This is to prevent sensitive information being sent to external recipients outside the Ministry of Justice.",
      "Updates to the display of data from the Workload Measurement Tool (WMT): We now show WMT data within the Team view screen.",
      "Change of wording from ‘Capacity to ‘Workload’: For clarity and consistency, we’ve changed the use of ‘Capacity’ to ‘Workload’ or ‘Workload %’.",
      "Updates to the back button on the Active cases screen: When using the back button on this screen, users were taken to the Overview screen. Users are now taken back to the Team allocation screen instead. "
    ]
  },
  {
    "heading": "3 September 2024",
    "whatsNew": [
      "Changes to allocation notes:",
      [
        "We've consolidated 'Explain your decision' and 'Allocation notes' into a single box 'Allocation notes and SPO Oversight'. This will continue to be sent to the allocated practitioner and there will be an option to edit these notes before saving as an SPO Oversight contact.",
        "We've added a warning message reminding users not to add links in the allocation notes."
      ],
      "User surveys: We've introduced an 'Is this page' useful survey on every page.",
      "Team changes:",
      [
        "We've added SPO roles for Yorkshire & The Humber",
        "We've added new teams for North West Region, South West Region, North East Region and South Central."
      ]
    ]
  },
  {
    "heading": "19 July 2024",
    "whatsNew": [
      "Registration data: We’ve added registration flag data to the registration tables on the risk page.",
      "Requirements allocation: Only unallocated requirements are allocated. Requirements that are already allocated, are no longer overwritten.",
      "Technical updates banner: We’ve renamed this to ‘What’s new’.",
      "CADE contact: The allocating SPO’s name is now displayed on the corresponding contact record in NDelius."
    ]
  },
  {
    "heading": "21 February 2024",
    "whatsNew": [
      "Allocating custody cases: We’ve made a number of small changes to support you with allocating custody-to-community cases through the service.",
      "COM handover: We’ve added the COM handover date to the Unallocated cases table.",
      "Deselecting empty teams: If you see empty teams on the Allocate cases by team screen or Select a probation practitioner screen, we’ve added a link to edit your teams list.",
      "Allocating other types of case: We’ve updated the content about what types of case cannot be allocated through the service, and will need to be done in NDelius.",
      "Who the initial appointment is with: If there’s an initial appointment date in the Unallocated cases table, it will display who the initial appointment is booked with.",
      "External transfers: We’ve added an ‘Action required’ badge to external transfer cases appearing in the Unallocated cases table. These cases cannot be allocated through the service until the transfer process is completed in NDelius. You can still review the case details.",
      "Entering an email address: We’ve updated the email address autocomplete functionality to trigger when uppercase letters are entered into the address field, so it will bring up the email address book.",
      "Notification email: We’ve updated the email content to include an Official-Sensitive disclaimer"
    ],
    "technicalFixes": [
      "We’ve fixed an issue with the beta banner where it was partially obscured at certain zoom levels.",
      "We’ve updated the names of some teams in the London region to fix spelling mistakes."
    ]
  },
  {
    "heading": "15 December 2023",
    "whatsNew": [],
    "technicalFixes": ["We’ve added the new regions that were onboarded in November to the probation estate."]
  },
  {
    "heading": "25 October 2023",
    "whatsNew": [
      "Select a probation practitioner screen: We moved the radio buttons to the left side of the probation practitioner table, to make it easier to use. ",
      "Case details screens: We moved the green Continue button to the bottom of the case details screens to be consistent with the buttons in the rest of the service.",
      "Persistent data sorting in tables: We updated the data sorting in tables to be retained when you navigate away.",
      "Notify email: We updated the data points in the email to display the correct court and sentencing data."
    ],
    "technicalFixes": [
      "We fixed a bug where no practitioners or practitioner workload were being displayed for one of our Beta teams.",
      "We fixed an issue where restricted LAO cases could be viewed through the service."
    ]
  },
  {
    "heading": "3 August 2023",
    "whatsNew": [
      "We added a Cookies statement for the service. It can be viewed by selecting the ‘Cookies’ link at the bottom of every screen.",
      "We added a survey that asks users about their experience of using the service."
    ],
    "technicalFixes": ["We fixed an error that was occurring when the user selected ‘Allocate case’."]
  },
  {
    "heading": "26 May 2023",
    "whatsNew": [
      "We added the ‘Explain your decision’ screen. The explanation will be saved to NDelius as a new contact type, called the Case Allocation Decision Evidencing (CADE) contact.",
      "We added details about the maximum character count to the free text box on the ‘Explain your decision’ screen."
    ],
    "technicalFixes": ["We fixed an issue where saving the CADE content returned a 406 error."]
  },
  {
    "heading": "31 March 2023",
    "whatsNew": [
      "Shared emails: we added shared mailboxes to the email address lookup. This means you can notify a whole team of an allocation.",
      "Cases allocated in the last 30 days: we introduced a new tab to the Unallocated cases screen, where you can see a list of the cases you’ve allocated through the service in the last 30 days.",
      "Updated risk content: we added ‘at a glance’ risk information to the Summary screen. The person on probation’s full details are still found on the Risk screen."
    ],
    "technicalFixes": [
      "We fixed an issue where the allocation demand was not updated when a case was being transferred to a different team."
    ]
  },
  {
    "heading": "17 February 2023",
    "whatsNew": [
      "Email autocomplete: we added email autocomplete functionality when sending allocation instructions, so you don't have to enter email addresses manually.",
      "Viewing allocation demand: we introduced a new process for surfacing allocation demand, that allows you to see unallocated cases in any team within a probation delivery unit (PDU).",
      "Start page: we added a Start page to the service, which explains the team selection and allocation demand processes to new users. This will only be seen once, when you first sign in.",
      "Allocating to multiple teams: we updated the Allocate to a probation practitioner screen, giving SPOs that allocate to multiple teams the option to view staff in a single list, or in their separate teams.",
      "Service name: we formalised the name for the service - ‘Allocate a Person on Probation’ - which was previously known as ‘Allocations’.",
      "Accessibility: we updated the Choose a practitioner table so the link to the practitioner’s Workload information is the practitioner’s name (rather than ‘View’). This is best practice for accessibility."
    ],
    "technicalFixes": [
      "We fixed an issue where users were unable to allocate a case if Javascript was turned off.",
      "We amended the process behind displaying the Allocation complete screen to reduce ‘page not found’ errors when users refresh the page.",
      "We fixed an issue where adding another email address on the Allocation instructions screen was moving the focus to the top of the page. The focus is now anchored to the email input box."
    ]
  }
]
