[
  {
    "heading": "15 December 2023",
    "whatsNew": [
      "Pre-sentence report: We had an issue where the wrong document was being displayed in the PSR section on the Summary screen. This is due to how documents are stored in NDelius. We’ve removed the PSR section and added a link to the main Documents screen, where <b>all documents</b> related to the current and previous events are listed. ",
      "Sorting the documents list: We’ve added help text about how to sort the documents list by date, event, document type, or name.",
      "Initial appointment: We’ve added who the initial appointment is with to the Unallocated cases table.",
      "Cannot allocate to a probation practitioner: We’ve updated the help text in the service to resolve this issue. “If you cannot allocate to a probation practitioner, it’s because their email address is not linked to their staff code in NDelius. Report the issue via Service Desk as an ‘unlinked officer code’.”"
    ],
    "technicalFixes": ["We’ve added the new regions that were onboarded in November to the probation estate."]
  },
  {
    "heading": "25 October 2023",
    "whatsNew": [
      "Select a probation practitioner screen: We moved the radio buttons to the left side of the probation practitioner table, to make it easier to use. ",
      "Case details screens: We moved the green Continue button to the bottom of the case details screens to be consistent with the buttons in the rest of the service.",
      "Persistent data sorting in tables: We updated the data sorting in tables to be retained when you navigate away.",
      "Notify email: We updated the data points in the email to display the correct court and sentencing data."
    ],
    "technicalFixes": [
      "We fixed a bug where no practitioners or practitioner workload were being displayed for one of our Beta teams.",
      "We fixed an issue where restricted LAO cases could be viewed through the service."
    ]
  },
  {
    "heading": "3 August 2023",
    "whatsNew": [
      "We added a Cookies statement for the service. It can be viewed by selecting the ‘Cookies’ link at the bottom of every screen.",
      "We added a survey that asks users about their experience of using the service."
    ],
    "technicalFixes": ["We fixed an error that was occurring when the user selected ‘Allocate case’."]
  },
  {
    "heading": "26 May 2023",
    "whatsNew": [
      "We added the ‘Explain your decision’ screen. The explanation will be saved to NDelius as a new contact type, called the Case Allocation Decision Evidencing (CADE) contact.",
      "We added details about the maximum character count to the free text box on the ‘Explain your decision’ screen."
    ],
    "technicalFixes": ["We fixed an issue where saving the CADE content returned a 406 error."]
  },
  {
    "heading": "31 March 2023",
    "whatsNew": [
      "Shared emails: we added shared mailboxes to the email address lookup. This means you can notify a whole team of an allocation.",
      "Cases allocated in the last 30 days: we introduced a new tab to the Unallocated cases screen, where you can see a list of the cases you’ve allocated through the service in the last 30 days.",
      "Updated risk content: we added ‘at a glance’ risk information to the Summary screen. The person on probation’s full details are still found on the Risk screen."
    ],
    "technicalFixes": [
      "We fixed an issue where the allocation demand was not updated when a case was being transferred to a different team."
    ]
  },
  {
    "heading": "17 February 2023",
    "whatsNew": [
      "Email autocomplete: we added email autocomplete functionality when sending allocation instructions, so you don't have to enter email addresses manually.",
      "Viewing allocation demand: we introduced a new process for surfacing allocation demand, that allows you to see unallocated cases in any team within a probation delivery unit (PDU).",
      "Start page: we added a Start page to the service, which explains the team selection and allocation demand processes to new users. This will only be seen once, when you first sign in.",
      "Allocating to multiple teams: we updated the Allocate to a probation practitioner screen, giving SPOs that allocate to multiple teams the option to view staff in a single list, or in their separate teams.",
      "Service name: we formalised the name for the service - ‘Allocate a Person on Probation’ - which was previously known as ‘Allocations’.",
      "Accessibility: we updated the Choose a practitioner table so the link to the practitioner’s Workload information is the practitioner’s name (rather than ‘View’). This is best practice for accessibility."
    ],
    "technicalFixes": [
      "We fixed an issue where users were unable to allocate a case if Javascript was turned off.",
      "We amended the process behind displaying the Allocation complete screen to reduce ‘page not found’ errors when users refresh the page.",
      "We fixed an issue where adding another email address on the Allocation instructions screen was moving the focus to the top of the page. The focus is now anchored to the email input box."
    ]
  }
]
